CNN(
  (pool): MaxPool2d(kernel_size=2, stride=2, padding=0, dilation=1, ceil_mode=False)
  (conv1): Conv2d(1, 10, kernel_size=(3, 3), stride=(1, 1))
  (conv2): Conv2d(10, 20, kernel_size=(4, 4), stride=(1, 1))
  (fc1): Linear(in_features=720, out_features=50, bias=True)
  (fc2): Linear(in_features=1024, out_features=10, bias=True)
)
Batch size: 20000 